Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_SKR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40020044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="USRK" edc:nzwidth="0x20" edc:desc="User Scrambling Key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40020048"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_WRACNT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40020054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="NBWRA" edc:nzwidth="0x20" edc:desc="Number of Write Accesses"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40020058"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TOUT" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40020064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TCNTM" edc:nzwidth="0x10" edc:desc="Time-out Counter Maximum Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7C" edc:_addr="0x40020068"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x400200E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Register Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x515350"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_WPSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0x400200E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x8" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400200EC"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40020100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40020104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40020108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4002010C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40020110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40020114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40020118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:nzwidth="0x20" edc:desc="Transmit Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4002011C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Next"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_PTCR" edc:nzwidth="0x20" edc:access="-------w----wwww------ww------ww" edc:impl="0x10F0303" edc:_addr="0x40020120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:nzwidth="0x1" edc:desc="Receiver Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Disable"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_PTSR" edc:nzwidth="0x20" edc:access="-------r-----r-r-------r-------r" edc:impl="0x1050101" edc:_addr="0x40020124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_PWPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x40020128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WPPTREN" edc:nzwidth="0x1" edc:desc="Write Protection Pointer Registers Enable"/>
            <edc:SFRFieldDef edc:cname="WPCTREN" edc:nzwidth="0x1" edc:desc="Write Protection Counter Registers Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Register Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3ED4" edc:_addr="0x4002012C"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CR" edc:nzwidth="0x20" edc:access="---------------------------ww-ww" edc:impl="0x1B" edc:_addr="0x40024000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Conversion"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWFIFO" edc:nzwidth="0x1" edc:desc="Software FIFO Reset"/>
            <edc:SFRFieldDef edc:cname="CMPRST" edc:nzwidth="0x1" edc:desc="Comparison Restart"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnnn---nnnnnnnnnnnn-nn-nnn-" edc:impl="0xFF8FFF6E" edc:_addr="0x40024004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:nzwidth="0x3" edc:desc="Trigger Selection">
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG0" edc:desc="PWM event line 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG1" edc:desc="TIOA0 TC0" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG2" edc:desc="TIOA1 TC0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG3" edc:desc="TIOA2 TC0" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG4" edc:desc="TIOA0 TC1" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG5" edc:desc="TIOA1 TC1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG6" edc:desc="RTCOUT0" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:nzwidth="0x1" edc:desc="Sleep Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode: The ADC core and reference voltage circuitry are kept on between conversions." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="Sleep mode: The wake-up time can be modified by programming the FWUP bit." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FWUP" edc:nzwidth="0x1" edc:desc="Fast Wake-up">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="If SLEEP is 1, then both ADC core and reference voltage circuitry are off between conversions." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="If SLEEP is 1, then Fast Wake-up Sleep mode: The voltage reference is on between conversions and ADC core is off." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCAL" edc:nzwidth="0x8" edc:desc="Prescaler Rate Selection"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x4" edc:desc="Startup Time">
              <edc:SFRFieldSemantic edc:cname="SUT0" edc:desc="0 period of ADCCLK" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUT8" edc:desc="8 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SUT16" edc:desc="16 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SUT24" edc:desc="24 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SUT64" edc:desc="64 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SUT80" edc:desc="80 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SUT96" edc:desc="96 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SUT112" edc:desc="112 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="SUT512" edc:desc="512 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SUT576" edc:desc="576 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="SUT640" edc:desc="640 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="SUT704" edc:desc="704 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SUT768" edc:desc="768 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="SUT832" edc:desc="832 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="SUT896" edc:desc="896 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SUT960" edc:desc="960 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ANACH" edc:nzwidth="0x1" edc:desc="Analog Change">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No analog change on channel switching: DIFF0 is used for all channels." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ALLOWED" edc:desc="Allows different analog settings for each channel. See ADC Channel Configuration Register." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRACKTIM" edc:nzwidth="0x4" edc:desc="Tracking Time"/>
            <edc:SFRFieldDef edc:cname="TRANSFER" edc:nzwidth="0x2" edc:desc="Transfer Time"/>
            <edc:SFRFieldDef edc:cname="ALWAYS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USEQ" edc:nzwidth="0x1" edc:desc="User Sequence Enable">
              <edc:SFRFieldSemantic edc:cname="NUM_ORDER" edc:desc="Normal mode: The controller converts channels in a simple numeric order depending only on the channel index." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REG_ORDER" edc:desc="User Sequence mode: The sequence respects what is defined in ADC_SEQR1and can be used to convert the same channel several times." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_SEQR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40024008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="USCH1" edc:nzwidth="0x4" edc:desc="User Sequence Number 1"/>
            <edc:SFRFieldDef edc:cname="USCH2" edc:nzwidth="0x4" edc:desc="User Sequence Number 2"/>
            <edc:SFRFieldDef edc:cname="USCH3" edc:nzwidth="0x4" edc:desc="User Sequence Number 3"/>
            <edc:SFRFieldDef edc:cname="USCH4" edc:nzwidth="0x4" edc:desc="User Sequence Number 4"/>
            <edc:SFRFieldDef edc:cname="USCH5" edc:nzwidth="0x4" edc:desc="User Sequence Number 5"/>
            <edc:SFRFieldDef edc:cname="USCH6" edc:nzwidth="0x4" edc:desc="User Sequence Number 6"/>
            <edc:SFRFieldDef edc:cname="USCH7" edc:nzwidth="0x4" edc:desc="User Sequence Number 7"/>
            <edc:SFRFieldDef edc:cname="USCH8" edc:nzwidth="0x4" edc:desc="User Sequence Number 8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4002400C"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHER" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40024010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Enable"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Enable"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Enable"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Enable"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHDR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40024014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Disable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Disable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Disable"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Disable"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Disable"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Disable"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Disable"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHSR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x40024018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Status"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Status"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Status"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Status"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Status"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Status"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Status"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4002401C"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_LCDR" edc:nzwidth="0x20" edc:access="---rrrrr--------rrrrrrrrrrrrrrrr" edc:impl="0x1F00FFFF" edc:_addr="0x40024020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="NO_OSR_LDATA" edc:nzwidth="0xC" edc:desc="Last Data Converted when No Oversampling"/>
            <edc:SFRFieldDef edc:cname="NO_OSR_CHNB" edc:nzwidth="0x4" edc:desc="Channel Number when No Oversampling"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNBOSR" edc:nzwidth="0x5" edc:desc="Channel Number in Oversampling Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
