Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR1" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40024064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR2" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40024068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR3" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4002406C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR4" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40024070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR5" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40024074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR6" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40024078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR7" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4002407C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_addr="0x40024080"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_ACR" edc:nzwidth="0x20" edc:access="---------nnn-----------------n--" edc:impl="0x700004" edc:_addr="0x400240E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ZBAT" edc:nzwidth="0x1" edc:desc="VBAT Resistive Load Selection"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="INTVREFEN" edc:nzwidth="0x1" edc:desc="ADC Internal Positive Voltage Reference Enable"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Enable"/>
            <edc:SFRFieldDef edc:cname="SMVT" edc:nzwidth="0x1" edc:desc="Supply Monitor Voltage Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_FMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn--------nnnn--nn" edc:impl="0xFF00F3" edc:_addr="0x400240E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="ENFIFO" edc:nzwidth="0x1" edc:desc="Enable FIFO">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="FIFO is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="FIFO is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENLEVEL" edc:nzwidth="0x1" edc:desc="Enable Level">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Request to DMA is generated as soon as one data is written in FIFO when FIFO is enabled. CHUNK is not used." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Request to DMA is generated as soon as the number of written elements in the FIFO is greater than or equal to CHUNK." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHUNK" edc:nzwidth="0x4" edc:desc="Chunk Size"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="FIFOCNT" edc:nzwidth="0x8" edc:desc="FIFO Count (read-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x400240E8"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40024100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40024104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40024108"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_RNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40024110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_RNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40024114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40024118"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_PTCR" edc:nzwidth="0x20" edc:access="-------w----wwww------ww------ww" edc:impl="0x10F0303" edc:_addr="0x40024120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:nzwidth="0x1" edc:desc="Receiver Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Disable"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
