Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4002802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Comparison Edge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_ISR" edc:nzwidth="0x20" edc:access="r-----------------------------rr" edc:impl="0x80000003" edc:_addr="0x40028030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Comparison Edge (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SCO" edc:nzwidth="0x1" edc:desc="Synchronized Comparator Output"/>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x1" edc:desc="Flag Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_addr="0x40028034"/>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_ACR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40028094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="MSEL" edc:nzwidth="0x1" edc:desc="Masking Period Selection">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Masks AC output for 16 peripheral clock periods after any write access in ACC_MR or ACC_CR" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Masks AC output for 128 peripheral clock periods after any write access in ACC_MR or ACC_CR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4C" edc:_addr="0x40028098"/>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400280E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_WPSR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x400280E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400280EC"/>
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_ISCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4002C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_ICCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4002C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
