Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_SMR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LCD0" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD1" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD2" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD3" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD4" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD5" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD6" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD7" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD8" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD9" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD10" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD11" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD12" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD13" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD14" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD15" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD16" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD17" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD18" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD19" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD20" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD21" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD22" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD23" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD24" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD25" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD26" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD27" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD28" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD29" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD30" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
            <edc:SFRFieldDef edc:cname="LCD31" edc:nzwidth="0x1" edc:desc="LCD Segment Mapped on SEGx I/O Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xB0" edc:_addr="0x40030034"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x400300E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534C43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x118" edc:_addr="0x400300E8"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40030204"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
