Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO_P0PIO0_P_CFGR" edc:nzwidth="0x20" edc:access="-nn--nnn------nnnnnn-nnn-----nnn" edc:impl="0x6703F707" edc:_addr="0x40049004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="FUNC" edc:nzwidth="0x3" edc:desc="I/O Line Function">
              <edc:SFRFieldSemantic edc:cname="GPIO" edc:desc="Select the PIO mode for the selected I/O lines." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_A" edc:desc="Select the peripheral A for the selected I/O lines." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_B" edc:desc="Select the peripheral B for the selected I/O lines." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_C" edc:desc="Select the peripheral C for the selected I/O lines." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_D" edc:desc="Select the peripheral D for the selected I/O lines." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Direction">
              <edc:SFRFieldSemantic edc:cname="INPUT" edc:desc="The selected I/O lines are pure inputs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTPUT" edc:desc="The selected I/O lines are enabled in output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PUEN" edc:nzwidth="0x1" edc:desc="Pull-Up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Pull-Up is disabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Pull-Up is enabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PDEN" edc:nzwidth="0x1" edc:desc="Pull-Down Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Pull-Down is disabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Pull-Down is enabled for the selected I/O lines only if PUEN is 0." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IFEN" edc:nzwidth="0x1" edc:desc="Input Filter Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The input filter is disabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The input filter is enabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IFSCEN" edc:nzwidth="0x1" edc:desc="Input Filter Slow Clock Enable"/>
            <edc:SFRFieldDef edc:cname="OPD" edc:nzwidth="0x1" edc:desc="Open-Drain">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCHMITT" edc:nzwidth="0x1" edc:desc="Schmitt Trigger">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Schmitt trigger is enabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Schmitt trigger is disabled for the selected I/O lines." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEWRATE" edc:nzwidth="0x2" edc:desc="Slew Rate">
              <edc:SFRFieldSemantic edc:cname="FAST" edc:desc="Slow slew rate" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUMFAST" edc:desc="Medium-fast slew rate" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Medium slew rate" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SLOW" edc:desc="Slow slew rate" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EVTSEL" edc:nzwidth="0x3" edc:desc="Event Selection">
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Event detection on input falling edge" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Event detection on input rising edge" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Event detection on input both edge" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Event detection on low level input" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Event detection on high level input" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCFS" edc:nzwidth="0x1" edc:desc="Physical Configuration Freeze Status (read-only)">
              <edc:SFRFieldSemantic edc:cname="NOT_FROZEN" edc:desc="The fields are not frozen and can be written for this I/O line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FROZEN" edc:desc="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ICFS" edc:nzwidth="0x1" edc:desc="Interrupt Configuration Freeze Status (read-only)">
              <edc:SFRFieldSemantic edc:cname="NOT_FROZEN" edc:desc="The fields are not frozen and can be written for this I/O line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FROZEN" edc:desc="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
