Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HCACHED_TAG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40050468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x10" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x4" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x4" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x4" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x4" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4005046C"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_FLASH" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40050470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="PATCH_BYPASS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050474"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_OPT_LINK" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40050480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="CLK_SELECT" edc:nzwidth="0x1" edc:desc="Clock Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050484"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_JTAG" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40050490">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="JTAG_LOCK" edc:nzwidth="0x1" edc:desc="JTAG Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050494"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_CORE_DEBUG_CFG" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x400504A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="SWV" edc:nzwidth="0x1" edc:desc="SWV Selection"/>
            <edc:SFRFieldDef edc:cname="XTRG1" edc:nzwidth="0x1" edc:desc="From Core 1 to Core 0 Cross Triggering"/>
            <edc:SFRFieldDef edc:cname="XTRG0" edc:nzwidth="0x1" edc:desc="From Core 0 to Core 1 Cross Triggering"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_EMAHB2AHB" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x400504A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="PFETCH8_0_1" edc:nzwidth="0x1" edc:desc="AHB MASTER0_1 Converter Prefetch">
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:desc="INCR undefined burst converted to burst of 4 data." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:desc="INCR undefined burst converted to burst of 8 data." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PFETCH8_1_0" edc:nzwidth="0x1" edc:desc="AHB MASTER1_0 Converter Prefetch">
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:desc="INCR undefined burst converted to burst of 4 data." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:desc="INCR undefined burst converted to burst of 8 data." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SECURE" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x400504A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_ENA" edc:nzwidth="0x1" edc:desc="ROM Access Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SECURE_BIT" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x400504AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="MODE_DIS" edc:nzwidth="0x1" edc:desc="Secure Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ERASE_FLASH_SRAM" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x400504B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="HW_ERASE" edc:nzwidth="0x1" edc:desc="PB2/Peripherals or Hardware Erase Signal Assignment">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Hardware erase signal disabled. PB2 pin can be used in GPIO or Peripheral IO mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Hardware erase signal enabled. PB2 pin is assigned to Flash erase function." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM0" edc:nzwidth="0x1" edc:desc="Erase SRAM0 Content">
              <edc:SFRFieldSemantic edc:cname="NOT_DELETED" edc:desc="If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is not deleted." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DELETED" edc:desc="If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is deleted." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_PWM_DEBUG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x400504B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="CORE0" edc:nzwidth="0x1" edc:desc="Debug Information Propagation Mode">
              <edc:SFRFieldSemantic edc:cname="NOT_SENT" edc:desc="Core x does not send the debug signal to the PWM." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SENT" edc:desc="Core x sends the debug signal to PWM. Refer to &quot;Debug Mode&quot; in the section &quot;Pulse Width Modulation Controller (PWM)&quot; for details on configuring an action when the debug signal is active." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CORE1" edc:nzwidth="0x1" edc:desc="Debug Information Propagation Mode">
              <edc:SFRFieldSemantic edc:cname="NOT_SENT" edc:desc="Core x does not send the debug signal to the PWM." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SENT" edc:desc="Core x sends the debug signal to PWM. Refer to &quot;Debug Mode&quot; in the section &quot;Pulse Width Modulation Controller (PWM)&quot; for details on configuring an action when the debug signal is active." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
