Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WCR" edc:nzwidth="0x20" edc:access="-------n---n--nn------------nnnn" edc:impl="0x113000F" edc:_addr="0x46800078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WKPIONB" edc:nzwidth="0x4" edc:desc="Wake-up Input Number"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable"/>
            <edc:SFRFieldDef edc:cname="WIP" edc:nzwidth="0x1" edc:desc="Wake-up Input Polarity"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIEN1" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1" edc:desc="Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FOCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x4680007C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:nzwidth="0x1" edc:desc="Fault Output Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CPFSMR" edc:nzwidth="0x20" edc:access="------------nnnn----------------" edc:impl="0xF0000" edc:_addr="0x46800080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:nzwidth="0x1" edc:desc="RTT Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:nzwidth="0x1" edc:desc="RTC Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="XTFA" edc:nzwidth="0x1" edc:desc="32KHz Crystal Failure Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="SMAL" edc:nzwidth="0x1" edc:desc="Supply Monitor Alarm Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------nn" edc:impl="0xFFFFFF03" edc:_addr="0x46800084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x46800088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCR" edc:nzwidth="0x20" edc:access="n-nnnnnnnnnnnnnn---nnnnn-nnnnnnn" edc:impl="0xBFFF1F7F" edc:_addr="0x4680008C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x7" edc:desc="Peripheral ID"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLKCSS" edc:nzwidth="0x5" edc:desc="Generic Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="MD_SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TD_SLOW_CLOCK" edc:desc="TD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK0" edc:desc="MCK0 is selected" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="PLLACK1" edc:desc="PLLACK1 is selected." edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="PLLBCK" edc:desc="PLLBCK is selected." edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="PLLCCK" edc:desc="PLLCCK is selected." edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PLLCSRC" edc:desc="PLLCSRC is selected." edc:when="(field &amp; 0x1F) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MCKID" edc:nzwidth="0x4" edc:desc="Master Clock Index (Read-only)"/>
            <edc:SFRFieldDef edc:cname="GCLKDIV" edc:nzwidth="0x8" edc:desc="Generic Clock Division Ratio"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="GCLKEN" edc:nzwidth="0x1" edc:desc="Generic Clock Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1" edc:desc="Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_OCR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn----------------" edc:impl="0xFF0000" edc:_addr="0x46800090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="CAL12" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits"/>
            <edc:SFRFieldDef edc:cname="SEL12" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_AIPR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x46800094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="AIP" edc:nzwidth="0x1" edc:desc="Activity In Progress"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWKCR" edc:nzwidth="0x20" edc:access="---n-----------n---n-----nnnnnnn" edc:impl="0x1001107F" edc:_addr="0x46800098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x7" edc:desc="Peripheral ID"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1" edc:desc="Command"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ASR" edc:nzwidth="0x1" edc:desc="Activity Status Register"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="SLPWKSR" edc:nzwidth="0x1" edc:desc="Partial Wake-up Sleep Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4680009C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_MCKLIM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x468000A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MCK_LOW_IT" edc:nzwidth="0x8" edc:desc="MCK0 Monitoring Low IT Limit"/>
            <edc:SFRFieldDef edc:cname="MCK_HIGH_IT" edc:nzwidth="0x8" edc:desc="MCK0 Monitoring High IT Limit"/>
            <edc:SFRFieldDef edc:cname="MCK_LOW_RES" edc:nzwidth="0x8" edc:desc="MCK0 Monitoring Low RESET Limit"/>
            <edc:SFRFieldDef edc:cname="MCK_HIGH_RES" edc:nzwidth="0x8" edc:desc="MCK0 Monitoring High Reset Limit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR0" edc:nzwidth="0x20" edc:access="rr-r--rrr-----rrrrrrrrr---------" edc:impl="0xD383FE00" edc:_addr="0x468000A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral Clock 9 Status"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral Clock 10 Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral Clock 11 Status"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:nzwidth="0x1" edc:desc="Peripheral Clock 12 Status"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral Clock 13 Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral Clock 14 Status"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral Clock 15 Status"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral Clock 16 Status"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:nzwidth="0x1" edc:desc="Peripheral Clock 17 Status"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral Clock 23 Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral Clock 24 Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral Clock 25 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral Clock 28 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral Clock 30 Status"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral Clock 31 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR1" edc:nzwidth="0x20" edc:access="----r-r-r-r-r-r---------rrrrrrrr" edc:impl="0xAAA00FF" edc:_addr="0x468000A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral Clock 32 Status"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral Clock 33 Status"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral Clock 34 Status"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral Clock 35 Status"/>
            <edc:SFRFieldDef edc:cname="PID36" edc:nzwidth="0x1" edc:desc="Peripheral Clock 36 Status"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:nzwidth="0x1" edc:desc="Peripheral Clock 37 Status"/>
            <edc:SFRFieldDef edc:cname="PID38" edc:nzwidth="0x1" edc:desc="Peripheral Clock 38 Status"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:nzwidth="0x1" edc:desc="Peripheral Clock 39 Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral Clock 49 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral Clock 51 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral Clock 53 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID55" edc:nzwidth="0x1" edc:desc="Peripheral Clock 55 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral Clock 57 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral Clock 59 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
