Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_IER" edc:nzwidth="0x20" edc:access="---------------ww--ww-wwwwwww-ww" edc:impl="0x19BFB" edc:_addr="0x48010008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Enable RXRDY Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Enable TXRDY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="Enable End of Receive Transfer Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="Enable End of Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Enable Overrun Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Enable Framing Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Enable Parity Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Enable Time-out Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Enable TXEMPTY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Enable Buffer Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Enable Buffer Full Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Enable Comparison Interrupt"/>
            <edc:SFRFieldDef edc:cname="ACE" edc:nzwidth="0x1" edc:desc="Enable Analog Comparator Event Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_IDR" edc:nzwidth="0x20" edc:access="---------------ww--ww-wwwwwww-ww" edc:impl="0x19BFB" edc:_addr="0x4801000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Disable RXRDY Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Disable TXRDY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="Disable End of Receive Transfer Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="Disable End of Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Disable Overrun Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Disable Framing Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Disable Parity Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Disable Time-out Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Disable TXEMPTY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Disable Buffer Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Disable Buffer Full Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Disable Comparison Interrupt"/>
            <edc:SFRFieldDef edc:cname="ACE" edc:nzwidth="0x1" edc:desc="Disable Analog Comparator Event Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_IMR" edc:nzwidth="0x20" edc:access="---------------rr--rr-rrrrrrr-rr" edc:impl="0x19BFB" edc:_addr="0x48010010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Mask RXRDY Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Mask TXRDY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="Mask End of Receive Transfer Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="Mask End of Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Mask Overrun Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Mask Framing Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Mask Parity Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Mask Time-out Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Mask TXEMPTY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Mask TXBUFE Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Mask RXBUFF Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Mask Comparison Interrupt"/>
            <edc:SFRFieldDef edc:cname="ACE" edc:nzwidth="0x1" edc:desc="Mask Analog Comparator Event Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_SR" edc:nzwidth="0x20" edc:access="---------------rr--rr-rrrrrrr-rr" edc:impl="0x19BFB" edc:_addr="0x48010014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready (Cleared by reading the UART_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmitter Ready (Cleared by writing the UART_THR)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmitter Transfer"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (Cleared by writing UART_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error (Cleared by writing UART_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error (Cleared by writing UART_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Receiver Time-out (Cleared by writing the UART_CR.STTTO)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmitter Empty (Cleared by writing the UART_THR)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmission Buffer Empty"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Match (Cleared by writing the UART_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="ACE" edc:nzwidth="0x1" edc:desc="Analog Comparator Event Interrupt (Cleared by writing UART_CR.RSTSTA)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_RHR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x48010018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:nzwidth="0x8" edc:desc="Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_THR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4801001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_BRGR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x48010020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="CD" edc:nzwidth="0x10" edc:desc="Clock Divisor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_CMPR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn-n-n----nnnnnnnn" edc:impl="0xFF50FF" edc:_addr="0x48010024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="VAL1" edc:nzwidth="0x8" edc:desc="First Comparison Value for Received Character"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x1" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:nzwidth="0x1" edc:desc="Compare Parity"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:nzwidth="0x8" edc:desc="Second Comparison Value for Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_RTOR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x48010028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="TO" edc:nzwidth="0x8" edc:desc="Time-out Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_CSR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4801002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="ACO" edc:nzwidth="0x1" edc:desc="Analog Comparator Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xB4" edc:_addr="0x48010030"/>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x480100E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x554152"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x480100E8"/>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48010100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x48010104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
