Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEIER" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4A000150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEIDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4A000154">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEIMR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4A000158">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MESR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4A00015C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEAR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4A000160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="ERRADD" edc:nzwidth="0x20" edc:desc="Master Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEAR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4A000164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="ERRADD" edc:nzwidth="0x20" edc:desc="Master Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEAR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4A000168">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="ERRADD" edc:nzwidth="0x20" edc:desc="Master Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MEAR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4A00016C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="ERRADD" edc:nzwidth="0x20" edc:desc="Master Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
